public class Zadanie3 {
    public static void main(String[] args) {
        // Напишите программу, которая выводит все числа от 10 до 1 в обратном порядке
        System.out.println("Числа от 10 до 1 в обратном порядке:");
        for (int i = 10; i >= 1; i--) {
            System.out.print(i + " ");
        }

    }
}
